In [1]:
import pandas as pd

In [7]:
df_costomer=pd.DataFrame({
    "costomer_id":[1,2,3,4],
    "name":["Adam","Bob","Charlie","Dave"]
})

df_orders=pd.DataFrame({
    "order_id":[101,102,103,104],
    "costomer_id":[2,1,4,5],
    "ammount":[250,230,120,200]
})

In [10]:
df_costomer
df_orders

# data merging two tables,we only use the matching values with on where the tabels values are matching
pd.merge(df_costomer,df_orders,on="costomer_id") #inner join
pd.merge(df_costomer,df_orders,on="costomer_id",how="left") 
#left join,that use the first all tables valuesand if the data is miss it replace by nan

pd.merge(df_costomer,df_orders,on="costomer_id",how="right")
#right join that use the second all table value and if the data is miss it replace by nan

pd.merge(df_costomer,df_orders,on="costomer_id",how="outer")
#outer join thta use all data and if the data is miss it replace by nan

   costomer_id     name  order_id  ammount
0            1     Adam     102.0    230.0
1            2      Bob     101.0    250.0
2            3  Charlie       NaN      NaN
3            4     Dave     103.0    120.0
4            5      NaN     104.0    200.0

In [17]:
# COncatenation data
# Stacking dtaframe on the top of each other rows or side by side columns

df1=pd.DataFrame({
    "costomer_id":[1,2,3,4],
    "name":["Adam","Bob","Charlie","Dave"]
})

df2=pd.DataFrame({
    "costomer_id":[5,6,7,8],
    "name":["Yogi","Dems","Loki","Jinwo"]
})

pd.concat([df1,df2])  #row wise data concate,stack data on the each of other
pd.concat([df1,df2],ignore_index=True)  #ignore the origanl index values

pd.concat([df1,df2],axis=1)  #column wise data concate,stack data on the side by side

   costomer_id     name  costomer_id   name
0            1     Adam            5   Yogi
1            2      Bob            6   Dems
2            3  Charlie            7   Loki
3            4     Dave            8  Jinwo

In [12]:
df1

   costomer_id     name
0            1     Adam
1            2      Bob
2            3  Charlie
3            4     Dave

In [13]:
df2

   costomer_id   name
0            5   yogi
1            6   dems
2            7   loki
3            8  jinwo